FIT_TOPS_DESCRIPTION = {"slim": "シルエットは細身のスリムフィットで、スタイリッシュな仕上がり。", "normal": "細すぎず太すぎずの絶妙なシルエット。", "loose": "ゆったりしたビッグシルエットで、程よい抜け感を演出。"}
FIT_TOPS_DESCRIPTION_WOMEN = {"slim": "すっきり細身で仕上げたボディが女性らしく着こなせるポイントです。", "normal": "細すぎず太すぎずの絶妙なシルエット。", "loose": "ゆったりとしたシルエットが気になるラインをカバーしてくれるのも魅力的。"}
FIT_TOPS_SELECT = {"slim": "細身", "normal": "普通", "loose": "ゆったり"}
FIT_BOTTOMS_DESCRIPTION = {"skinny": "穿き心地が良く、スタイリッシュなスタイリングが決まるスキニーパンツ。", "standard": "レッグラインを締めつけ過ぎないレギュラーフィットで、気張らないムードを出すことができます。", "wide": "トレンドのワイドパンツは全体的に緩くまとめて抜け感のある着こなしにぴったり。"}
FIT_BOTTOMS_DESCRIPTION_WOMEN = {"skinny": "スリムシルエットがレッグラインをスッキリと演出してくれます。", "standard": "レッグラインを締めつけ過ぎないレギュラーフィットで、気張らないムードを出すことができます。", "wide": "トレンドのワイドパンツは全体的に緩くまとめて抜け感のある着こなしにぴったり。"}
FIT_BOTTOMS_SELECT = {"skinny": "スキニー", "standard": "スタンダード", "wide": "ワイド"}

FIT_SKIRT_DESCRIPTION_WOMEN = {"tight": "ボディに程よくフィットするタイトシルエットが、着こなしに上品な雰囲気をプラスしてくれるひと品。", "flare": "裾に向かって広がるフレアラインがウエストや脚を細く見せてくれます。",
"trapezoid": "タイトすぎずふんわりしすぎない台形シルエットのスカートは大人女性の強い味方。", "pleat": "歩く度に揺れるプリーツのシルエットが印象的な女性らしい一着。", "tiered": "段になったデザインが印象的なティアードスカート、このボリューム感がフェミニンな印象を与えてくれる人気のシルエット。"}
FIT_SKIRT_SELECT = {"tight": "タイト", "flare": "フレア", "trapezoid": "台形", "pleat": "プリーツ", "tiered": "ティアード"}

DESIGN_TOPS_DESCRIPTION = {"solid": "無駄な装飾を省いたベーシックなデザインは、様々な着こなしをお楽しみいただけます。",
                           "border": "爽やかな雰囲気を醸し出すボーダー柄がポイント。",
                           "dot": "トレンドかつ定番で人気のドットパターンを落とし込んだ着こなしのアクセントになる事間違い無しの1枚。",
                           "stripe": "ストライプ柄がシャープさをプラスして、上品な印象に着こなせます。",
                           "check": "ベーシックで着回しやすいチェック柄はカジュアルスタイルに活躍。"}
DESIGN_TOPS_DESCRIPTION_WOMEN = {"solid": "無駄な装飾を省いたベーシックなデザインは、様々な着こなしをお楽しみいただけます。",
                           "border": "爽やかな雰囲気を醸し出すボーダー柄がポイント。",
                           "dot": "トレンドかつ定番で人気のドットパターンを落とし込んだ着こなしのアクセントになる事間違い無しの1枚。",
                           "stripe": "ストライプ柄がシャープさをプラスして、上品な印象に着こなせます。",
                           "check": "ベーシックで着回しやすいチェック柄はカジュアルスタイルに活躍。"}
DESIGN_TOPS_SELECT = {"solid": "無地", "border": "ボーダー", "dot": "ドット", "stripe": "ストライプ", "check": "チェック"}

DESIGN_BOTTOMS_DESCRIPTION = {"solid": "無駄な装飾を省いたベーシックなデザインは、様々な着こなしをお楽しみいただけます。",
                           "border": "爽やかな雰囲気を醸し出すボーダー柄がポイント。",
                           "dot": "ドットパターンを落とし込んだ着こなしのアクセントになる事間違い無しの1枚。",
                           "stripe": "ストライプ柄がシャープさをプラスして、上品な印象に着こなせます。",
                           "check": "上品なチェック柄は単調な着こなしのアクセントになります。"}
DESIGN_BOTTOMS_DESCRIPTION_WOMEN = {"solid": "無駄な装飾を省いたベーシックなデザインは、様々な着こなしをお楽しみいただけます。",
                           "border": "爽やかな雰囲気を醸し出すボーダー柄がポイント。",
                           "dot": "ドットパターンを落とし込んだ着こなしのアクセントになる事間違い無しの1枚。",
                           "stripe": "ストライプ柄がシャープさをプラスして、上品な印象に着こなせます。",
                           "check": "上品なチェック柄は単調な着こなしのアクセントになります。"}
DESIGN_BOTTOMS_SELECT = {"solid": "無地", "border": "ボーダー", "dot": "ドット", "stripe": "ストライプ", "check": "チェック"}

NECK_TOPS_DESCRIPTION = {"crew": "ネックはシンプルなクルーネックで着回し自在。",
                         "u": "オープンカラーシャツやジャケットなどのインナーに合わせやすいUネックデザイン。",
                         "v": "首から顔周りにかけてすっきり見せてくれるVネックは1枚着でもシャツのインナーとしても、様々なシーンでの活用が可能。",
                         "boat": "浅い船底型をした襟ぐりのボートネックは、やや横に広く鎖骨に沿ってカーブしているためシャツをインでもきれいに見えます。"}
NECK_TOPS_DESCRIPTION_WOMEN = {"crew": "ネックはシンプルなクルーネックで着回し自在。",
                         "u": "オープンカラーシャツやジャケットなどのインナーに合わせやすいUネックデザイン。",
                         "v": "首から顔周りにかけてすっきり見せてくれるVネックは1枚着でもシャツのインナーとしても、様々なシーンでの活用が可能。",
                         "boat": "浅い船底型をした襟ぐりのボートネックは、やや横に広く鎖骨に沿ってカーブしているためシャツをインでもきれいに見えます。"}
NECK_TOPS_SELECT = {"crew": "クルーネック", "u": "Uネック", "v": "Vネック", "boat": "ボートネック"}


COLLER_TOPS_DESCRIPTION = {"regular": "スタイリングに取り入れやすいベーシックなレギュラーカラーは幅広いシーンに活躍します。",
                         "button": "襟はボタンダウンなので、タイドアップしてジャケットのインナーはもちろん、ノータイでも綺麗に決まります。",
                         "open": "トレンドのオープンカラーはリラックス感のある着こなしを演出していただけます。",
                         "stand": "襟にスタンドカラーを使用することにより首元をスッキリ見せ洗練された印象を与えることができるのが特徴です。"}
COLLER_TOPS_DESCRIPTION_WOMEN = {"regular": "スタイリングに取り入れやすいベーシックなレギュラーカラーは幅広いシーンに活躍します。",
                         "button": "襟はボタンダウンなので、タイドアップしてジャケットのインナーはもちろん、ノータイでも綺麗に決まります。",
                         "open": "トレンドのオープンカラーはリラックス感のある着こなしを演出していただけます。",
                         "stand": "襟にスタンドカラーを使用することにより首元をスッキリ見せ洗練された印象を与えることができるのが特徴です。"}
COLLER_TOPS_SELECT = {"regular": "レギュラー", "button": "ボタンダウン", "open": "オープン", "stand": "スタンド"}

ZIPBUTTON_TOPS_DESCRIPTION = {"pullover": "プルオーバータイプなのでカジュアルでリラックス感のある着こなしを演出していただけます。",
                         "zipup": "定番のジップアップパーカーは、軽い羽織アイテムとして、また冬はコートなどのインナーとして、様々な着こなしが可能です。長いシーズン着まわしていただけるとても汎用性の高いアイテムです。"}
ZIPBUTTON_TOPS_DESCRIPTION_WOMEN = {"pullover": "プルオーバータイプなのでカジュアルでリラックス感のある着こなしを演出していただけます。",
                         "zipup": "定番のジップアップパーカーは、軽い羽織アイテムとして、また冬はコートなどのインナーとして、様々な着こなしが可能です。長いシーズン着まわしていただけるとても汎用性の高いアイテムです。"}

ZIPBUTTON_TOPS_SELECT = {"pullover": "プルオーバー", "zipup": "ジップアップ"}

LENGTH_BOTTOMS_DESCRIPTION = {"short": "裾の長さは膝上丈に設定しているので、スッキリスマートなシルエット。",
                         "half": "膝上程度の丈感は長すぎず短すぎずのすっきりとしたサイジングです。",
                         "cropped": " ジャストサイズのアンクル丈は、トップスとのバランスだけでなく、スニーカーでも革靴でもハマってくれます。",
                         "full": "丈はフルレングスでオールシーズン活躍できます。",}
LENGTH_BOTTOMS_DESCRIPTION_WOMEN = {"short": "裾の長さは膝上丈に設定しているので、スッキリスマートなシルエット。",
                         "half": "膝上程度の丈感は長すぎず短すぎずのすっきりとしたサイジングです。",
                         "cropped": " ジャストサイズのアンクル丈は、トップスとのバランスだけでなく、スニーカーでも革靴でもハマってくれます。",
                         "full": "丈はフルレングスでオールシーズン活躍できます。",}
LENGTH_BOTTOMS_SELECT = {"short": "ひざ上", "half": "ひざ丈", "cropped": "クロップド", "full": "フルレングス"}

LEG_BOTTOMS_DESCRIPTION = {"tapered": "裾に向かってすっきりと絞り込んだテーパードシルエットはレッグラインを美しく見せます。",
                         "flare": "程よく広がるブーツカットシルエットは足が抜群にキレイに見えるようにデザインされています。",}
LEG_BOTTOMS_DESCRIPTION_WOMEN = {"tapered": "裾に向かってすっきりと絞り込んだテーパードシルエットはレッグラインを美しく見せます。",
                         "flare": "程よく広がるブーツカットシルエットは足が抜群にキレイに見えるようにデザインされています。",}
LEG_BOTTOMS_SELECT = {"tapered": "テーパード", "flare": "フレア・ブーツカット",}

EFFECT_BOTTOMS_DESCRIPTION = {"rigid": "クリーンな濃紺デニムはキレイめからカジュアルまで様々なスタイルに対応できます。",
                         "used": "ユーズド加工はウォッシュをかけた様な風合いで、さまざまなトップスと相性の良いパンツです。手元に届いたその日からヴィンテージ感を楽しめます。",
                         "crash": "クラッシュ加工を施すことで経年変化による自然な風合いのダメージ感が見事再現されており、確かな技術と徹底したこだわりが落とし込まれています。",}
EFFECT_BOTTOMS_SELECT = {"rigid": "リジッド", "used": "ユーズド加工", "crash":"クラッシュ・ダメージ加工"}

EFFECT_BOTTOMS_DESCRIPTION_WOMEN = {"rigid": "クリーンな濃紺デニムはキレイめからカジュアルまで様々なスタイルに対応できます。",
                         "used": "ユーズド加工はウォッシュをかけた様な風合いで、さまざまなトップスと相性の良いパンツです。手元に届いたその日からヴィンテージ感を楽しめます。",
                         "crash": "クラッシュ加工を施すことで経年変化による自然な風合いのダメージ感が見事再現されており、確かな技術と徹底したこだわりが落とし込まれています。",}                
EFFECT_BOTTOMS_SELECT_WOMEN = {"rigid": "リジッド", "used": "ユーズド加工", "crash":"クラッシュ・ダメージ加工"}

LENGTH_SKIRT_DESCRIPTION_WOMEN = {"mini": "短めの丈は足長効果があり、健康美をアピールしてくれます。",
                         "knee": "定番のミドル丈は、誰もが似合う女性らしさ引き立つデザイン。",
                         "long": "ロング丈なので可愛くなりすぎず、大人っぽく着ていただけます。",
                         "mi-mollet": "ミモレ丈が足のラインをカバーしてくれるので、肌の露出が気になる季節のお助けアイテムになること間違いなし。"}                
LENGTH_SKIRT_SELECT = {"mini": "ショート・ミニ丈", "knee": "ひざ丈", "long":"ロング・マキシ丈", "mi-mollet":"ミモレ・半端丈",}
